/* 
  Localizable.strings
  ownCloudSDK

  Created by Felix Schwarz on 03.03.18.
  Copyright © 2018 ownCloud GmbH. All rights reserved.
*/

/* Item property names */
"itemProperty.lastModified" = "שונה לאחרונה";
"itemProperty.isFavorite" = "מועדף";
"itemProperty.localAttributes" = "משתנים מקומיים";

/* Connection Progress */
"Connecting…" = "מתחבר...";
"Authenticating…" = "מאמת...";
"Error" = "שגיאה";
"Fetching user information…" = "מאחזר פרטי משתמש...";
"Connected" = "מחובר";

"Retrieving thumbnail…" = "מאחזר תמונה ממוזערת...";

"Cancel" = "ביטול";
"Proceed" = "להמשך";
"OK" = "אישור";

/* Connection status */
"Offline" = "לא מקוון";
"Offline (no WiFi connection)" = "לא מקוון (אין חיבור WiFi)";
"Server down for maintenance" = "השרת הורד למטרת תחזוקה";
"Online" = "מקוון";

/* Delete */
"%@ changed on the server. Really delete it?" = "%@ שונה על השרת. באמת למחוק אותו?";
"%@ has changed on the server since you requested its deletion." = "%@ שונה על השרת מאז ביקשת למחוק אותו.";
"Delete" = "מחיקה";

"%@ couldn't be deleted" = "%@ לא ניתן למחיקה";
"Please check if you have sufficient permissions to delete %@." = "יש לבדוק אם יש ברשותך מספיק הרשאות למחיקת %@.";

/* Copy / Move */
"Operation forbidden" = "פעילות אסורה";
"%@ can't be copied to %@." = "%@ לא ניתן להעתקה אל %@.";
"%@ can't be moved to %@." = "%@ לא ניתן להעברה אל %@.";

"%@ not found" = "%@ לא נמצא";
"%@ wasn't found at %@." = "%@ לא נמצא ב- %@.";

"The target directory %@ doesn't seem to exist." = "תיקיית היעד %@ ככל הנראה אינה קיימת.";

"%@ already exists" = "%@ כבר קיים";
"Couldn't copy %@ to %@, because an item called %@ already exists there." = "לא ניתן היה להעתיק את %@ ל- %@, כיוון שפריט בשם %@ כבר קיים שם.";
"Couldn't move %@ to %@, because an item called %@ already exists there." = "לא ניתן היה להעביר את %@ ל- %@, כיוון שפריט בשם %@ כבר קיים שם.";

"Insufficient permissions" = "אין הרשאות מספקות";
"%@ can't be copied to %@." = "%@ לא ניתן להעתקה אל %@.";
"%@ can't be moved to %@." = "%@ לא ניתן להעברה אל %@.";

"%@ not found on the server" = "%@ לא נמצא על השרת";
"%@ may have been renamed, moved or deleted remotely." = "%@ יתכן ושונה שמו, הועבר או נמחק מרחוק.";

"Error copying %@" = "שגיאה בהעתקת %@";
"Error moving %@" = "שגיאה בהעברת %@";

/* Download */
"Downloading %@…" = "מוריד %@…";

/* Move/Rename/Copy */
"Renaming %@ to %@…" = "משנה שם %@ ל- %@…";
"Moving %@ to %@…" = "מעביר %@ ל- %@…";
"Copying %@ to %@…" = "מעתיק %@ ל- %@…";

/* Create folder */
"Creating folder %@…" = "יוצק תיקייה %@…";

/* Delete */
"Deleting %@…" = "מוחק %@…";

/* Retrieving file list */
"Retrieving file list for %@…" = "מאחזר רשימת קבצים ל- %@…";

/* Update */
"\"%@\" metadata for %@ couldn't be updated" = "לא ניתן היה לעדכן מטה-דטה \"%@\" ל- %@ ";
"Update failed with status code %d" = "העדכון נכשל עם קוד מצב %d";
"Error updating %@ metadata" = "שגיאה בעדכון מטה-דטה %@";

/* Logging */
"Standard error output" = "פלט שגיאה רגיל";
"Log file" = "קובץ תיעוד";

/* Errors */
"Server doesn't seem to support any authentication method supported by this app." = "לא נראה שהשרת תומך באף שיטת אימות הנתמכת על ידי היישום.";
"This server runs an unsupported version (%@). Version %@ or later is required by this app." = "שרת זה מריץ גרסה  (%@) שאינה נתמכת. גרסה %@ או גרסה מאוחרת יותר נדרשת על ידי יישום זה.";

/* DAV Errors */
// OCDAVErrorServiceUnavailable
"Server down for maintenance." = "השרת ירד עבור תחזוקה.";

/* OC Errors */
"%@ (error %ld, %@)" = "%@ (שגיאה %ld, %@)";
"%@ (error %ld)" = "%@ (שגיאה %ld)";

// OCErrorInternal
"Internal error." = "שגיאה פנימית.";

// OCErrorInsufficientParameters
"Insufficient parameters." = "פרמטרים לא מספקים.";

// OCErrorAuthorizationFailed
"Authorization failed." = "האימות נכשל.";

// OCErrorAuthorizationRedirect
"Authorization failed because the server returned a redirect. Authorization may be successful when retried with the redirect URL." = "Authorization failed because the server returned a redirect. Authorization may be successful when retried with the redirect URL.";

// OCErrorAuthorizationNoMethodData
"Authorization failed because no secret data was set for the authentication method." = "Authorization failed because no secret data was set for the authentication method.";

// OCErrorAuthorizationMissingData
"Authorization failed because data was missing from the secret data for the authentication method." = "Authorization failed because data was missing from the secret data for the authentication method.";

// OCErrroAuthorizationCancelled
"Authorization was cancelled by the user." = "Authorization was cancelled by the user.";

// OCErrorRequestURLSessionTaskConstructionFailed
"Construction of URL Session Task failed." = "Construction of URL Session Task failed.";

// OCErrorNewerVersionExists
"A newer version already exists." = "גרסה חדשה יותר כבר קיימת.";

// OCErrorRequestCancelled
"Request was cancelled." = "הבקשה בוטלה.";

// OCErrorRequestRemovedBeforeScheduling
"Request was removed before scheduling." = "הבקשה הוסרה לפני תזמון.";

// OCErrorRequestServerCertificateRejected
"Request was cancelled because the server certificate was rejected." = "הבקשה בוטלה כיוון שתעודת האימות של השרת נדחתה.";

// OCErrorRequestDroppedByURLSession
"Request was dropped by the NSURLSession." = "הבקשה בוטלה על ידי ה- NSURLSession.";

// OCErrorRequestCompletedWithError
"Request completed with error." = "הבקשה הושלמה עם שגיאה.";

// OCErrorRequestURLSessionInvalidated
"Request couldn't be scheduled because the underlying URL session has been invalidated." = "לא ניתן היה לתזמן את הבקשה כיוון שנתיב שיחת המחשב המודגש נפסלה.";

// OCErrorException
"An exception occured." = "חריגה התרחשה.";

// OCErrorResponseUnknownFormat
"Response was in an unknown format." = "התגובה התקבלה בתבנית לא ידועה.";

// OCErrorServerDetectionFailed
"Server detection failed, i.e. when the server at a URL is not an ownCloud instance." = "גילוי השרת נכשל, דהיינו השרת בנתיב האינטרנט אינו של ownCloud.";

// OCErrorServerTooManyRedirects
"Server detection failed because of too many redirects." = "גילוי השרת נכשל בשל יותר מדי הפניות.";

// OCErrorServerBadRedirection
"Server redirection to bad/invalid URL." = "הפנית שרת לנתיב פגום/לא חוקי.";

// OCErrorServerVersionNotSupported
"This server version is not supported." = "This server version is not supported.";

// OCErrorServerNoSupportedAuthMethods
"Server doesn't seem to support any authentication method supported by this app." = "לא נראה שהשרת תומך באף שיטת אימות הנתמכת על ידי היישום.";

// OCErrorCertificateInvalid
"The certificate is invalid or contains errors" = "The certificate is invalid or contains errors";

// OCErrorCertificateMissing
"No certificate was returned for a request despite this being a HTTPS connection (should never occur in production, but only if you forgot to provide a certificate during simulated responses to HTTPS requests)." = "No certificate was returned for a request despite this being a HTTPS connection (should never occur in production, but only if you forgot to provide a certificate during simulated responses to HTTPS requests).";

// OCErrorFeatureNotSupportedForItem
"This feature is not supported for this item." = "This feature is not supported for this item.";

// OCErrorFeatureNotSupportedByServer
"This feature is not supported for this server (version)." = "This feature is not supported for this server (version).";

// OCErrorFeatureNotImplemented
"This feature is currently not implemented" = "This feature is currently not implemented";

// OCErrorItemNotFound
"The targeted item has not been found." = "The targeted item has not been found.";

// OCErrorItemDestinationNotFound
"The destination item has not been found." = "The destination item has not been found.";

// OCErrorItemChanged
"The targeted item has changed." = "The targeted item has changed.";

// OCErrorItemInsufficientPermissions
"The action couldn't be performed on the targeted item because the client lacks permissions." = "The action couldn't be performed on the targeted item because the client lacks permissions.";

// OCErrorItemOperationForbidden
"The operation on the targeted item is not allowed." = "The operation on the targeted item is not allowed.";

// OCErrorItemAlreadyExists
"There already is an item at the destination of this action." = "There already is an item at the destination of this action.";

// OCErrorItemNotAvailableOffline
"Item not available offline." = "Item not available offline.";

// OCErrorFileNotFound:
"File not found." = "File not found.";

// OCErrorCancelled
"The operation was cancelled." = "The operation was cancelled.";

// OCErrorOutdatedCache
"An operation failed due to outdated cache information." = "An operation failed due to outdated cache information.";

// OCErrorRunningOperation
"A running operation prevents execution." = "A running operation prevents execution.";
